# Problem Use given hiring.csv file to predict the salary for the following candidates:

## 1) 2 year experience,  9 test score and 6 interview score
## 2) 10 year experience, 10 test score and 10 interview score

In [1]:
#import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as pyt
from sklearn import linear_model
%matplotlib inline

In [4]:
# import data
df = pd.read_csv(r"Exercise\hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

# data cleaning

In [5]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [6]:
df["experience"].fillna(0,inplace = True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [8]:
test_score_median = df["test_score(out of 10)"].median()
test_score_median

8.0

In [9]:
df["test_score(out of 10)"].fillna(test_score_median,inplace = True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
df.isnull().sum()

experience                    0
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

# Convert string number to interger